docs/implementation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-30 Mon 18:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Davide Badalotti" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org501af75">1. Notes on implementation</a>
<ul>
<li><a href="#org0a02a87">1.1. Module MetricMeasureSpaces.jl</a>
<ul>
<li><a href="#org8c005ae">1.1.1. struct MetricMeasureSpace</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org501af75" class="outline-2">
<h2 id="org501af75"><span class="section-number-2">1.</span> Notes on implementation</h2>
<div class="outline-text-2" id="text-1">
<p>
This document serves as a look-up for the implementation of the package. It is useful to collect all the necessary information that guides the development.
</p>
</div>


<div id="outline-container-org0a02a87" class="outline-3">
<h3 id="org0a02a87"><span class="section-number-3">1.1.</span> Module MetricMeasureSpaces.jl</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This contains the struct and functions related to metric measure spaces. For this project 
we initially consider only <b>finite</b> metric measure spaces. We summarize everything here.
</p>
</div>


<div id="outline-container-org8c005ae" class="outline-4">
<h4 id="org8c005ae"><span class="section-number-4">1.1.1.</span> struct MetricMeasureSpace</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #5EC4FF;">struct</span> <span style="color: #EBBF83;">MetricMeasureSpace</span>:
    C::<span style="color: #EBBF83;">SMatrix</span>
    \mu::<span style="color: #EBBF83;">StaticArray</span>
    constructor1<span style="color: #5EC4FF;">(</span>C, mu=<span style="color: #E27E8D;">nothing</span><span style="color: #5EC4FF;">)</span>
    constructor2<span style="color: #5EC4FF;">(</span>array, dist_function, mu=<span style="color: #E27E8D;">nothing</span><span style="color: #5EC4FF;">)</span>
<span style="color: #5EC4FF;">end</span>
</pre>
</div>
</div>


<ol class="org-ol">
<li><a id="org05ef92e"></a>C:<br />
<div class="outline-text-5" id="text-1-1-1-1">
<ul class="org-ul">
<li>static matrix (Float64)</li>
<li>dimension NxN</li>
<li>It contains the dissimilarities between elements of the metric space. Since it is not a distance, it can contain any value.</li>
<li>It must be of type Float64 for implementation purposes (we have to apply gradient based optimization).</li>
</ul>
</div>
</li>

<li><a id="org7d99d4c"></a>&mu;<br />
<div class="outline-text-5" id="text-1-1-1-2">
<ul class="org-ul">
<li>static array (Float64), dimension N.</li>
<li>It contains the relative importance of each element in the space.</li>
<li>it must be positive</li>
<li>it must sum to 1 (represents a probability)</li>
<li>it must have the same dimension as matrix C</li>
</ul>
</div>
</li>

<li><a id="org99b9d3d"></a>constructor1: inner constructor.<br />
<div class="outline-text-5" id="text-1-1-1-3">
<p>
Arguments:
</p>
<ul class="org-ul">
<li>C matrix of numeric type. Dimension NxN.</li>
<li>&mu;. Optional. array of {float, int, rational, uint}.</li>
</ul>

<p>
Requirements:
</p>
<ul class="org-ul">
<li>If &mu; has a negative entry &#x2013;&gt; raise error</li>
<li>If &mu; is not normalized &#x2013;&gt; renormalize and raise warning</li>
<li>If &mu; and C have different dimensions &#x2013;&gt; raise error</li>
<li>Force &mu; to be Float64</li>
<li>Force C to be Float64</li>
<li>if &mu; is not provided, initialized as uniform.</li>
</ul>
</div>
</li>

<li><a id="orgdfdfec0"></a>constructor2 : second inner constructor<br />
<ol class="org-ol">
<li><a id="org808b347"></a><span class="todo TODO">TODO</span> decide that maybe it can be an outer constructor<br />
<div class="outline-text-6" id="text-1-1-1-4-1">
<p>
Arguments:
</p>
<ul class="org-ul">
<li>elements. Array of any type (T for example).</li>
<li>dist. Function of type dist(T, T): Float. It takes two elements of type T and determines their dissimilarity.
Not necessarily a distance.</li>
<li>&mu;. Optional. array of {float, int, rational, uint}.</li>
</ul>

<p>
Requirements:
</p>
<ul class="org-ul">
<li>It calculates C according to elements and dist.</li>
<li>It must check that the elements are all of the same type.</li>
<li>The it calls constructor1.</li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Davide Badalotti</p>
<p class="date">Created: 2023-01-30 Mon 18:54</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
